def zdh1():
    coun = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                 "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                 "Северная Македония": "Скопье", "Сербия": "Белград"}
    print(coun)
    print(coun["Франция"])
    for key in sorted(coun):
        print(key, "-", coun[key])
def zdh2():
    import re
    alp = {1:'АВЕИНОРСТ',
      	2:'ДКЛМПУ',
      	3:'БГЁЬЯ',
      	4:'ЙЫ',
      	5:'ЖЗХЦЧ',
      	8:'ШЭЮ',
      	10:'ФЩЪ'}
    word = input().upper()
    print(sum([k for i in word for k, v in alp.items() if i in v]))

def zdh3():
    le = ['рус', 'англ', 'китай']
    sp = {'рус': ['бигалиев', 'алаев','урманов','акимов','смирнов'],
        'англ': ['бигалиев','алаев','урманов','акимов','смирнов'],
        'китай': ['бигалиев', 'алаев','урманов','акимов','смирнов']}
    le.sort()
    s = len(le)
    print('Количество языков' ,s)
    print('Список по алфавиту',le)
    print('Введите любой язык из списка')
    a = str(input())
    print(sp[a])

zdh1()
zdh2()
zdh3()